Public Member Functions | List of all members
ACAPI::MEP::VentilationPort::Modifier Class Referencefinal
MEP Element Manager
Modifier of the VentilationPort. More...
#include <MEPVentilationPort.hpp>
 Inheritance diagram for ACAPI::MEP::VentilationPort::Modifier:
 Public Member Functions
Result< void >  | SetWallThickness (double thickness)
Sets the thickness of the port's wall.
Result< void >  | SetFlowDirection (FlowDirection flowDirection)
Sets the flow direction of the port.
 Public Member Functions inherited from ACAPI::MEP::PortBase::Modifier
Result< void >  | SetWidth (double width)
Sets the width of the port.
Result< void >  | SetHeight (double height)
Sets the height of the port.
Result< void >  | SetShape (ConnectorShape shape)
Sets the shape of the port.
Result< void >  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::PortBase::Modifier
Modifier (PortBase &parent)
Constructs a Modifier with the given port base parent.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the VentilationPort.
Member Function Documentation
◆ SetFlowDirection()
 Result< void > ACAPI::MEP::VentilationPort::Modifier::SetFlowDirection  |  ( |  FlowDirection |  flowDirection | )
Sets the flow direction of the port.
Parameters
flowDirection | The value to be set.
Returns
Returns an error if you are trying to modify a Port which has a derived FlowDirection (e.g. the Ports of a RigidSegment), otherwise nothing.
◆ SetWallThickness()
 Result< void > ACAPI::MEP::VentilationPort::Modifier::SetWallThickness  |  ( |  double |  thickness | )
Sets the thickness of the port's wall.
Parameters
thickness | The value to be set.
Returns
Returns an error if you are trying to modify a Port of a Branch or a Port which has a derived wall thickness (e.g. the Ports of a RigidSegment), otherwise nothing.